RT-Thread/rt-thread/bsp/stm32/libraries/STM32L5xx_HAL/STM32L5xx_HAL_Driver/Src/stm32l5xx_hal_gtzc.c
    reg_value = READ_REG(GTZC_TZSC->SECCFGR2);
    for (/*i = 32U*/; i < GTZC_TZSC_PERIPH_NUMBER; i++)
    {
      if (((reg_value & (1UL << (i - 32U))) >> (i - 32U)) != 0U)
      {
        PeriphAttributes[i] = GTZC_TZSC_PERIPH_SEC;
      }
      else
      {
        PeriphAttributes[i] = GTZC_TZSC_PERIPH_NSEC;
      }
    }

    /* get privilege configuration: read each register and deploy each bit value
     * of corresponding index in the destination array
     */
    reg_value = READ_REG(GTZC_TZSC->PRIVCFGR1);
    for (i = 0U; i < 32U; i++)
    {
      if (((reg_value & (1UL << i)) >> i) != 0U)
      {
        PeriphAttributes[i] |= GTZC_TZSC_PERIPH_PRIV;
      }
      else
      {
        PeriphAttributes[i] |= GTZC_TZSC_PERIPH_NPRIV;
      }
    }

    reg_value = READ_REG(GTZC_TZSC->PRIVCFGR2);
    for (/*i = 32U*/; i < GTZC_TZSC_PERIPH_NUMBER; i++)
    {
      if (((reg_value & (1UL << (i - 32U))) >> (i - 32U)) != 0U)
      {
        PeriphAttributes[i] |= GTZC_TZSC_PERIPH_PRIV;
      }
      else
      {
        PeriphAttributes[i] |= GTZC_TZSC_PERIPH_NPRIV;
      }
    }

  }
  else
  {
    /* common case where only one peripheral is configured */

    /* secure configuration */
    register_address = (uint32_t) &(GTZC_TZSC->SECCFGR1) + (4U * GTZC_GET_REG_INDEX(PeriphId));

    if (((READ_BIT(*(__IO uint32_t *)register_address,
                   1UL << GTZC_GET_PERIPH_POS(PeriphId))) >> GTZC_GET_PERIPH_POS(PeriphId))
        != 0U)
    {
      *PeriphAttributes = GTZC_TZSC_PERIPH_SEC;
    }
    else
    {
      *PeriphAttributes = GTZC_TZSC_PERIPH_NSEC;
    }

    /* privilege configuration */
    register_address = (uint32_t) &(GTZC_TZSC->PRIVCFGR1) + (4U * GTZC_GET_REG_INDEX(PeriphId));

    if (((READ_BIT(*(__IO uint32_t *)register_address,
                   1UL << GTZC_GET_PERIPH_POS(PeriphId))) >> GTZC_GET_PERIPH_POS(PeriphId))
        != 0U)
    {
      *PeriphAttributes |= GTZC_TZSC_PERIPH_PRIV;
    }
    else
    {
      *PeriphAttributes |= GTZC_TZSC_PERIPH_NPRIV;
    }
  }
  return HAL_OK;
}

/**
  * @}
  */

#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3U)

/** @defgroup GTZC_Exported_Functions_Group2 MPCWM Configuration functions
  * @brief    MPCWM Configuration functions
  *
  @verbatim
  ==============================================================================
            ##### MPCWM Configuration functions #####
  ==============================================================================
  [..]
    This section provides functions allowing to configure MPCWM
    MPCWM is Memory Protection Controller WaterMark
@endverbatim
  * @{
  */

/**
  * @brief  Configure a TZSC-MPCWM area.
  * @param  MemBaseAddress WM identifier.
  * @param  pMPCWM_Desc TZSC-MPCWM descriptor pointer.
  *         The structure description is available in @ref GTZC_Exported_Types.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_GTZC_TZSC_MPCWM_ConfigMemAttributes(uint32_t MemBaseAddress,
                                                          MPCWM_ConfigTypeDef *pMPCWM_Desc)
{
  uint32_t register_address;
  uint32_t reg_value;
  uint32_t size;
  uint32_t start_pos, start_msk;
  uint32_t length_pos, length_msk;

  /* check entry parameters */
  if ((pMPCWM_Desc->AreaId > GTZC_TZSC_MPCWM_ID2)
      || ((MemBaseAddress == FMC_BANK3) && (pMPCWM_Desc->AreaId == GTZC_TZSC_MPCWM_ID2))
      || ((pMPCWM_Desc->Offset % GTZC_TZSC_MPCWM_GRANULARITY) != 0U)
      || ((pMPCWM_Desc->Length % GTZC_TZSC_MPCWM_GRANULARITY) != 0U))
  {
    return HAL_ERROR;
  }

  /* check descriptor content vs. memory capacity */
  switch (MemBaseAddress)
  {
    case OCTOSPI1_BASE:
      size = GTZC_TZSC_MPCWM1_MEM_SIZE;
      if (pMPCWM_Desc->AreaId == GTZC_TZSC_MPCWM_ID1)
      {
        register_address = (uint32_t) &(GTZC_TZSC_S->MPCWM1_NSWMR1);
        start_pos = GTZC_TZSC_MPCWM1_NSWMR1_NSWM1STRT_Pos;
        start_msk = GTZC_TZSC_MPCWM1_NSWMR1_NSWM1STRT_Msk;
        length_pos = GTZC_TZSC_MPCWM1_NSWMR1_NSWM1LGTH_Pos;
        length_msk = GTZC_TZSC_MPCWM1_NSWMR1_NSWM1LGTH_Msk;
      }
      else
      {
        /* Here pMPCWM_Desc->AreaId == GTZC_TZSC_MPCWM_ID2
         * (Parameter already checked)
         */
        register_address = (uint32_t) &(GTZC_TZSC_S->MPCWM1_NSWMR2);
        start_pos = GTZC_TZSC_MPCWM1_NSWMR2_NSWM2STRT_Pos;
        start_msk = GTZC_TZSC_MPCWM1_NSWMR2_NSWM2STRT_Msk;
        length_pos = GTZC_TZSC_MPCWM1_NSWMR2_NSWM2LGTH_Pos;
        length_msk = GTZC_TZSC_MPCWM1_NSWMR2_NSWM2LGTH_Msk;
      }
      break;
    case FMC_BANK1:
      size = GTZC_TZSC_MPCWM1_MEM_SIZE;
      if (pMPCWM_Desc->AreaId == GTZC_TZSC_MPCWM_ID1)
      {
        register_address = (uint32_t) &(GTZC_TZSC_S->MPCWM2_NSWMR1);
        start_pos = GTZC_TZSC_MPCWM2_NSWMR1_NSWM1STRT_Pos;
        start_msk = GTZC_TZSC_MPCWM2_NSWMR1_NSWM1STRT_Msk;
        length_pos = GTZC_TZSC_MPCWM2_NSWMR1_NSWM1LGTH_Pos;
        length_msk = GTZC_TZSC_MPCWM2_NSWMR1_NSWM1LGTH_Msk;
      }
      else
      {
        /* Here pMPCWM_Desc->AreaId == GTZC_TZSC_MPCWM_ID2
         * (Parameter already checked)
         */
        register_address = (uint32_t) &(GTZC_TZSC_S->MPCWM2_NSWMR2);
        start_pos = GTZC_TZSC_MPCWM2_NSWMR2_NSWM2STRT_Pos;
        start_msk = GTZC_TZSC_MPCWM2_NSWMR2_NSWM2STRT_Msk;
        length_pos = GTZC_TZSC_MPCWM2_NSWMR2_NSWM2LGTH_Pos;
        length_msk = GTZC_TZSC_MPCWM2_NSWMR2_NSWM2LGTH_Msk;
      }
      break;
    case FMC_BANK3:
      /* Here pMPCWM_Desc->AreaId == GTZC_TZSC_MPCWM_ID1
       * (Parameter already checked)
       */
      size = GTZC_TZSC_MPCWM3_MEM_SIZE;
      register_address = (uint32_t) &(GTZC_TZSC_S->MPCWM3_NSWMR1);
      start_pos = GTZC_TZSC_MPCWM3_NSWMR1_NSWM1STRT_Pos;
      start_msk = GTZC_TZSC_MPCWM3_NSWMR1_NSWM1STRT_Msk;
      length_pos = GTZC_TZSC_MPCWM3_NSWMR1_NSWM1LGTH_Pos;
      length_msk = GTZC_TZSC_MPCWM3_NSWMR1_NSWM1LGTH_Msk;
      break;
    default:
      return HAL_ERROR;
      break;
  }

  if ((pMPCWM_Desc->Offset > size)
      || ((pMPCWM_Desc->Offset + pMPCWM_Desc->Length) > size))
  {
    return HAL_ERROR;
  }

  /* write descriptor value */
  reg_value = ((pMPCWM_Desc->Offset / GTZC_TZSC_MPCWM_GRANULARITY) << start_pos) & start_msk;
  reg_value |= ((pMPCWM_Desc->Length / GTZC_TZSC_MPCWM_GRANULARITY) << length_pos) & length_msk;
  MODIFY_REG(*(__IO uint32_t *)register_address, start_msk | length_msk, reg_value);

  return HAL_OK;
}

/**
  * @brief  Get a TZSC-MPCWM area configuration.
  * @param  MemBaseAddress WM identifier.
  * @param  pMPCWM_Desc pointer to a TZSC-MPCWM descriptor.
  *         The structure description is available in @ref GTZC_Exported_Types.
  * @retval HAL status.
  */
HAL_StatusTypeDef HAL_GTZC_TZSC_MPCWM_GetConfigMemAttributes(uint32_t MemBaseAddress,
                                                             MPCWM_ConfigTypeDef *pMPCWM_Desc)
{
  uint32_t register_address;
  uint32_t reg_value;
  uint32_t start_pos, start_msk;
  uint32_t length_pos, length_msk;

  /* firstly take care of the first area, present on all MPCWM sub-blocks */
  switch (MemBaseAddress)
  {
    case OCTOSPI1_BASE:
      register_address = (uint32_t) &(GTZC_TZSC_S->MPCWM1_NSWMR1);
      start_pos = GTZC_TZSC_MPCWM1_NSWMR1_NSWM1STRT_Pos;
      start_msk = GTZC_TZSC_MPCWM1_NSWMR1_NSWM1STRT_Msk;
      length_pos = GTZC_TZSC_MPCWM1_NSWMR1_NSWM1LGTH_Pos;
      length_msk = GTZC_TZSC_MPCWM1_NSWMR1_NSWM1LGTH_Msk;
      break;
    case FMC_BANK1:
      register_address = (uint32_t) &(GTZC_TZSC_S->MPCWM2_NSWMR1);
      start_pos = GTZC_TZSC_MPCWM2_NSWMR1_NSWM1STRT_Pos;
      start_msk = GTZC_TZSC_MPCWM2_NSWMR1_NSWM1STRT_Msk;
      length_pos = GTZC_TZSC_MPCWM2_NSWMR1_NSWM1LGTH_Pos;
      length_msk = GTZC_TZSC_MPCWM2_NSWMR1_NSWM1LGTH_Msk;
      break;
    case FMC_BANK3:
      register_address = (uint32_t) &(GTZC_TZSC_S->MPCWM3_NSWMR1);
      start_pos = GTZC_TZSC_MPCWM3_NSWMR1_NSWM1STRT_Pos;
      start_msk = GTZC_TZSC_MPCWM3_NSWMR1_NSWM1STRT_Msk;
      length_pos = GTZC_TZSC_MPCWM3_NSWMR1_NSWM1LGTH_Pos;
      length_msk = GTZC_TZSC_MPCWM3_NSWMR1_NSWM1LGTH_Msk;
      break;
    default:
      return HAL_ERROR;
      break;
  }

  /* read register and update the descriptor for first area*/
  reg_value = READ_REG(*(__IO uint32_t *)register_address);
  pMPCWM_Desc[0].AreaId = GTZC_TZSC_MPCWM_ID1;
  pMPCWM_Desc[0].Offset = ((reg_value & start_msk) >> start_pos) * GTZC_TZSC_MPCWM_GRANULARITY;
  pMPCWM_Desc[0].Length = ((reg_value & length_msk) >> length_pos) * GTZC_TZSC_MPCWM_GRANULARITY;

